SRC/Config/InformationRegisters/с_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>с_Настройки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.с_Настройки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

SRC/Config/InformationRegisters/с_Настройки/Ext/ManagerModule.bsl
// ++ Ситис: p.virich   2018-07-08
Функция ПолучитьНастройку(Настройка, Период = Неопределено, Организация=Неопределено, ВернутьБулево=Ложь) Экспорт

	Перем РезультатФункции;
 	
	Запрос			= Новый Запрос;

	Запрос.УстановитьПараметр("Настройка", Настройка);
	Запрос.УстановитьПараметр("Период" , Период);		
	
	ЗапросТекст	= "ВЫБРАТЬ
	           	  |	с_Настройки.Значение КАК Значение
	           	  |ИЗ
	           	  |	РегистрСведений.с_Настройки.СрезПоследних(
	           	  |			&Период,
	           	  |			Настройка = &Настройка
	           	  |				И 1 = 1) КАК с_Настройки
	           	  |
	           	  |УПОРЯДОЧИТЬ ПО
	           	  |	с_Настройки.Организация";    	
	
	
	Если Организация <> Неопределено Тогда
		Запрос.УстановитьПараметр("Организация" , Организация);		
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "1 = 1", "Организация = &Организация");
	КонецЕсли;    	

	Запрос.Текст = ЗапросТекст;

	Результат		= Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		
		Если ВернутьБулево Тогда
			РезультатФункции =  Ложь;
 		КонецЕсли;
		
	Иначе
		
		Выборка		= Результат.Выбрать();
		Выборка.Следующий();
		Значение	= Выборка.Значение;
		
		Если ВернутьБулево Тогда
			
			Если ТипЗнч(Значение)=Тип("Булево") Тогда
				РезультатФункции = Значение;
			Иначе
				РезультатФункции = ЗначениеЗаполнено(Значение);
			КонецЕсли;
			
		Иначе
			
			РезультатФункции =  Значение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат РезультатФункции;
	
КонецФункции  // -- Ситис: p.virich   2018-07-08
